bases/Wim_Du/projects/IMDEV-ГруппПерезаполнение/Расширения/IM1109261/DataProcessors/ГрупповоеПерезаполнениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ГрупповоеПерезаполнениеДокументов</Name>
		</Properties>
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДокумента</Name>
					<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>40</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПерезаполнятьКонтрольДопустимогоУровняРиска</Name>
					<Type><v8:Type>xs:boolean</v8:Type></Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-ГруппПерезаполнение/Расширения/IM1109261/DataProcessors/ГрупповоеПерезаполнениеДокументов/Forms/Форма/Ext/Form/Module.bsl
#Область IMDEV_110926_1

&НаКлиенте
&ИзменениеИКонтроль("Перезаполнить")
Процедура IM1109261_Перезаполнить(Команда)
	
	ОчиститьСообщения();
	
	//Инициализация документов для перезаполнения
	Если Объект.ВидДокумента = "Расчет СЧА/РСА" Тогда
		Макет = "РасчетСЧА_РСА";
		ПроцедураЗаполнения = "ПолучитьСуммыРСАСЧА()";
		
	ИначеЕсли Объект.ВидДокумента = "Начисление %% по банковским счетам" Тогда
		Макет = "НачислениеПроцентовПоБанковскимСчетам";
		ПроцедураЗаполнения = "ЗаполнитьТЧ()";
		
	ИначеЕсли Объект.ВидДокумента = "Погашение облигаций" Тогда
		Макет = "ПогашениеОблигаций";
		ПроцедураЗаполнения = "ЗаполнитьСписокОблигаций(Истина, Истина)";
		
	ИначеЕсли Объект.ВидДокумента = "Реформация баланса" Тогда
		Макет = "РеформацияБаланса";
		ПроцедураЗаполнения = "ЗаполнитьОборотыПоСчетам()";
		
	ИначеЕсли Объект.ВидДокумента = "Погашение НКД" Тогда
		Макет = "ПереводНКДВЗадолженностьЭмитента";
		ПроцедураЗаполнения = "ЗаполнитьКупоннымиПериодами()";
		
	ИначеЕсли Объект.ВидДокумента = "Начисление купонного дохода" Тогда 
		Макет = "НачислениеКупонногоДохода";
		ПроцедураЗаполнения = "ЗаполнитьКупоннымиПериодами()";
		
	ИначеЕсли Объект.ВидДокумента = "Переоценка активов" Тогда
		Макет = "ПереоценкаАктивов";
		ПроцедураЗаполнения = "ЗаполнитьТЧ()";
		
	ИначеЕсли Объект.ВидДокумента = "Переоценка взаиморасчетов" Тогда
		Макет = "ПереоценкаВзаиморасчетов";
		ПроцедураЗаполнения = "ЗаполнитьВзаиморасчеты()";
		
	ИначеЕсли Объект.ВидДокумента = "Переоценка денежных средств" Тогда
		Макет = "ПереоценкаДенежныхСредств";
		ПроцедураЗаполнения = "ЗаполнитьТабличнуюЧастьАктивами()";
		
	ИначеЕсли Объект.ВидДокумента = "Установка котировок ц/б" Тогда
		Макет = "УстановкаКотировокЦБ";
		ПроцедураЗаполнения = "ЗаполнитьКотировки()";
		
	ИначеЕсли Объект.ВидДокумента = "Установка котировок ц/б (по пулам)" Тогда
		Макет = "УстановкаКотировокЦБПоПулам";
		ПроцедураЗаполнения = "ЗаполнитьКотировки()"; 
		
	КонецЕсли;
	
#Вставка
	Если Объект.ВидДокумента <> "Установка котировок ц/б (по пулам)" Тогда
		
		РезультатЗадания = ЗапуститьПерезаполнениеНаСервере();
		Если РезультатЗадания = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьЗавершениеПерезаполнения", ЭтотОбъект);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru='Групповое перезаполнение документов...'");
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, Оповещение, ПараметрыОжидания);
		Возврат;
		
	КонецЕсли;
#КонецВставки
	МассивДокументовДляПерепроведения = ПолучитьМассивДокументовДляПерепроведения(Макет);
	Если ТипЗнч(МассивДокументовДляПерепроведения) <> Тип("Массив") Тогда Возврат; КонецЕсли;
	
#Вставка
	ОписаниеЗамера = НачатьЗамерПерезаполненияНаСервере();
#КонецВставки
	КартинкаИндикатора = БиблиотекаКартинок.ДлительнаяОперация48;
	
	Обработано = 0;
	МаксимальноеЗначение = МассивДокументовДляПерепроведения.Количество();
	Для каждого Ссылка Из МассивДокументовДляПерепроведения Цикл
		ТекстСостояния = НСтр("ru = 'Групповое перезаполнение документов'");
		Состояние(ТекстСостояния, Окр(100*Обработано/МаксимальноеЗначение), Ссылка, КартинкаИндикатора);
		ПереполнитьДокументы(Ссылка, ПроцедураЗаполнения);
		Обработано = Обработано + 1;
	КонецЦикла; 
	
	// ASP-139357 {
	Если Объект.ВидДокумента = "Расчет СЧА/РСА" И Объект.ПерезаполнятьКонтрольДопустимогоУровняРиска Тогда
		
		Макет = "КонтрольДопустимогоУровняРиска";
		ПроцедураЗаполнения = "РасчитатьУменьшениеСтоимостиПортфеля()";
		
		МассивДокументовДляПерепроведения = ПолучитьМассивДокументовДляПерепроведения(Макет);
		Если ТипЗнч(МассивДокументовДляПерепроведения) = Тип("Массив") Тогда 
			МаксимальноеЗначение = МассивДокументовДляПерепроведения.Количество();
			Для каждого Ссылка Из МассивДокументовДляПерепроведения Цикл
				ТекстСостояния = НСтр("ru = 'Групповое перезаполнение документов'");
				Состояние(ТекстСостояния, Окр(100*Обработано/МаксимальноеЗначение), Ссылка, КартинкаИндикатора);
				ПереполнитьДокументы(Ссылка, ПроцедураЗаполнения);
				Обработано = Обработано + 1;
			КонецЦикла;
		КонецЕсли;

	КонецЕсли; // }
	
	ТекстСостояния = НСтр("ru = 'Групповое перезаполнение документов'");
	Состояние(ТекстСостояния, 100, , КартинкаИндикатора);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = НСтр("ru = 'Перезаполнение документов завершено. Обработано: '") + Обработано + НСтр("ru = ' док.'");
	Сообщение.Сообщить();
	
#Вставка
	КомментарийЗамера = СтрШаблон(
		НСтр("ru='Вид=%1; Договоров=0; Документов=%2; Риск=Нет; Потоков=1; Успешно=%2; Ошибок=0; Порция=1'"),
		Объект.ВидДокумента,
		Формат(Обработано, "ЧН=0; ЧГ="));
	ЗакончитьЗамерПерезаполненияНаСервере(ОписаниеЗамера, Обработано, КомментарийЗамера);
#КонецВставки
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗавершениеПерезаполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Групповое перезаполнение отменено.'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Ошибка группового перезаполнения: '")
			+ Результат.КраткоеПредставлениеОшибки;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьПерезаполнениеНаСервере()
	
	Макет = "";
	ПроцедураЗаполнения = "";
	ИмяДокументаМетаданных = "";
	
	Если Объект.ВидДокумента = "Расчет СЧА/РСА" Тогда
		Макет = "РасчетСЧА_РСА";
		ПроцедураЗаполнения = "ПолучитьСуммыРСАСЧА()";
		ИмяДокументаМетаданных = "РасчетСЧА_РСА";
		
	ИначеЕсли Объект.ВидДокумента = "Начисление %% по банковским счетам" Тогда
		Макет = "НачислениеПроцентовПоБанковскимСчетам";
		ПроцедураЗаполнения = "ЗаполнитьТЧ()";
		ИмяДокументаМетаданных = "НачислениеПроцентовПоБанковскимСчетам";
		
	ИначеЕсли Объект.ВидДокумента = "Погашение облигаций" Тогда
		Макет = "ПогашениеОблигаций";
		ПроцедураЗаполнения = "ЗаполнитьСписокОблигаций(Истина, Истина)";
		ИмяДокументаМетаданных = "ПогашениеОблигаций";
		
	ИначеЕсли Объект.ВидДокумента = "Реформация баланса" Тогда
		Макет = "РеформацияБаланса";
		ПроцедураЗаполнения = "ЗаполнитьОборотыПоСчетам()";
		ИмяДокументаМетаданных = "РеформацияБаланса";
		
	ИначеЕсли Объект.ВидДокумента = "Погашение НКД" Тогда
		Макет = "ПереводНКДВЗадолженностьЭмитента";
		ПроцедураЗаполнения = "ЗаполнитьКупоннымиПериодами()";
		ИмяДокументаМетаданных = "ПереводНКДВЗадолженностьЭмитента";
		
	ИначеЕсли Объект.ВидДокумента = "Начисление купонного дохода" Тогда
		Макет = "НачислениеКупонногоДохода";
		ПроцедураЗаполнения = "ЗаполнитьКупоннымиПериодами()";
		ИмяДокументаМетаданных = "НачислениеКупонногоДохода";
		
	ИначеЕсли Объект.ВидДокумента = "Переоценка активов" Тогда
		Макет = "ПереоценкаАктивов";
		ПроцедураЗаполнения = "ЗаполнитьТЧ()";
		ИмяДокументаМетаданных = "ПереоценкаАктивов";
		
	ИначеЕсли Объект.ВидДокумента = "Переоценка взаиморасчетов" Тогда
		Макет = "ПереоценкаВзаиморасчетов";
		ПроцедураЗаполнения = "ЗаполнитьВзаиморасчеты()";
		ИмяДокументаМетаданных = "ПереоценкаВзаиморасчетов";
		
	ИначеЕсли Объект.ВидДокумента = "Переоценка денежных средств" Тогда
		Макет = "ПереоценкаДенежныхСредств";
		ПроцедураЗаполнения = "ЗаполнитьТабличнуюЧастьАктивами()";
		ИмяДокументаМетаданных = "ПереоценкаДенежныхСредств";
		
	ИначеЕсли Объект.ВидДокумента = "Установка котировок ц/б" Тогда
		Макет = "УстановкаКотировокЦБ";
		ПроцедураЗаполнения = "ЗаполнитьКотировки()";
		ИмяДокументаМетаданных = "УстановкаКотировокЦБ";
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбран вид документа для перезаполнения.'");
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	МассивДокументов = ПолучитьМассивДокументовДляПерепроведения(Макет);
	Если ТипЗнч(МассивДокументов) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаДокументов = ТаблицаДокументовПоСсылкам(МассивДокументов, ИмяДокументаМетаданных);
	
	ФлагРиска = Объект.ВидДокумента = "Расчет СЧА/РСА"
		И Объект.ПерезаполнятьКонтрольДопустимогоУровняРиска;
	
	ТаблицаРиска = Новый ТаблицаЗначений;
	ТаблицаРиска.Колонки.Добавить("Ссылка");
	ТаблицаРиска.Колонки.Добавить("ДоговорДУ");
	
	Если ФлагРиска Тогда
		МассивРиска = ПолучитьМассивДокументовДляПерепроведения("КонтрольДопустимогоУровняРиска");
		Если ТипЗнч(МассивРиска) = Тип("Массив") Тогда
			ТаблицаРиска = ТаблицаДокументовПоСсылкам(МассивРиска, "КонтрольДопустимогоУровняРиска");
		КонецЕсли;
	КонецЕсли;
	
	КоличествоПотоков = Константы.МаксимальноеКоличествоПараллельныхПотоков.Получить();
	РазмерПорции = ОбщегоНазначенияДУ.ПолучитьЧисловуюКонстанту("МаксимальныйРазмерПорцииДоговоровВПотокеРегл", 50);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ВидДокумента", Объект.ВидДокумента);
	ПараметрыПроцедуры.Вставить("ТаблицаДокументов", ТаблицаДокументов);
	ПараметрыПроцедуры.Вставить("ТаблицаРиска", ТаблицаРиска);
	ПараметрыПроцедуры.Вставить("ПроцедураЗаполнения", ПроцедураЗаполнения);
	ПараметрыПроцедуры.Вставить("ПроцедураЗаполненияРиска", "РасчитатьУменьшениеСтоимостиПортфеля()");
	ПараметрыПроцедуры.Вставить("ФлагРиска", ФлагРиска);
	ПараметрыПроцедуры.Вставить("КоличествоПотоков", КоличествоПотоков);
	ПараметрыПроцедуры.Вставить("РазмерПорции", РазмерПорции);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Групповое перезаполнение документов'");
	ПараметрыВыполнения.КлючФоновогоЗадания = "IM1109261_ГрупповоеПерезаполнение";
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ГрупповоеПерезаполнениеДокументов.ВыполнитьГрупповоеПерезаполнение",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Функция НачатьЗамерПерезаполненияНаСервере()
	
	Возврат ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"ДУ.ГрупповоеПерезаполнениеДокументов");
	
КонецФункции

&НаСервере
Процедура ЗакончитьЗамерПерезаполненияНаСервере(ОписаниеЗамера, КоличествоДанных, Комментарий)
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(
		ОписаниеЗамера,
		КоличествоДанных,
		"",
		Комментарий);
	
КонецПроцедуры

&НаСервере
Функция ТаблицаДокументовПоСсылкам(МассивСсылок, ИмяДокументаМетаданных)
	
	ТаблицаДокументов = Новый ТаблицаЗначений;
	ТаблицаДокументов.Колонки.Добавить("Ссылка");
	ТаблицаДокументов.Колонки.Добавить("ДоговорДУ");
	
	Если МассивСсылок.Количество() = 0 Или Не ЗначениеЗаполнено(ИмяДокументаМетаданных) Тогда
		Возврат ТаблицаДокументов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.ДоговорДУ КАК ДоговорДУ
	|ИЗ
	|	Документ." + ИмяДокументаМетаданных + " КАК Док
	|ГДЕ
	|	Док.Ссылка В (&Ссылки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.Дата,
	|	Док.Ссылка";
	Запрос.УстановитьПараметр("Ссылки", МассивСсылок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаДокументов.Добавить();
		СтрокаТаблицы.Ссылка = Выборка.Ссылка;
		СтрокаТаблицы.ДоговорДУ = Выборка.ДоговорДУ;
	КонецЦикла;
	
	Возврат ТаблицаДокументов;
	
КонецФункции

#КонецОбласти
